//*SUB PROGRAM JCL
//BATCHIDX JOB 1,CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(BATCHIDX),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(BATCHIDX),DISP=SHR
// IF RC < 5 THEN
//RUN     EXEC PGM=BATCHIDX
//STEPLIB   DD DSN=&SYSUID..LOAD,DISP=SHR
//DATAFILE  DD DSN=&SYSUID..VSAM.AA,DISP=SHR
//SYSOUT    DD SYSOUT=A
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY
// ELSE
// ENDIF
